#include "stdafx.h"
#include "ddutil.h"
#include "BaseUI.h"


//--------------------------------------------------------------
//  Name : ~BaseUI ()
//  Desc :		생성자
//--------------------------------------------------------------
CBaseUI :: CBaseUI ()
{
	PosX = 0;
	PosY = 0;
	Width = 0;
	Height = 0;
}


CBaseUI :: CBaseUI (int x, int y, int w, int h)
{
	PosX = x;
	PosY = y;
	Width = w;
	Height = h;
}


//--------------------------------------------------------------
//  Name : ~BaseUI ()
//  Desc :		소멸자
//--------------------------------------------------------------
CBaseUI :: ~CBaseUI ()
{
}

//--------------------------------------------------------------
//  Name : Draw ()
//  Desc :		그리기...
//--------------------------------------------------------------
void CBaseUI :: Draw ()
{
}
